In [62]:
import pandas as pd
import numpy as np

In [63]:
# load data
data = pd.read_csv('/Users/sahajadlakha/Documents/DEV_ZONE/MachineLearning/MLCSE4020/lab-2/data/crx.data', header = None)

In [64]:
# creating list of variables for the dataset
varnames = ['A' + str(i) for i in range(1,17)]

In [65]:
# adding column names
data.columns = varnames

In [66]:
# replace ? with np.nan
data = data.replace('?', np.nan)

In [67]:
print(data)

    A1     A2      A3 A4 A5  A6  A7    A8 A9 A10  A11 A12 A13    A14  A15 A16
0    b  30.83   0.000  u  g   w   v  1.25  t   t    1   f   g  00202    0   +
1    a  58.67   4.460  u  g   q   h  3.04  t   t    6   f   g  00043  560   +
2    a  24.50   0.500  u  g   q   h  1.50  t   f    0   f   g  00280  824   +
3    b  27.83   1.540  u  g   w   v  3.75  t   t    5   t   g  00100    3   +
4    b  20.17   5.625  u  g   w   v  1.71  t   f    0   f   s  00120    0   +
..  ..    ...     ... .. ..  ..  ..   ... ..  ..  ...  ..  ..    ...  ...  ..
685  b  21.08  10.085  y  p   e   h  1.25  f   f    0   f   g  00260    0   -
686  a  22.67   0.750  u  g   c   v  2.00  f   t    2   t   g  00200  394   -
687  a  25.25  13.500  y  p  ff  ff  2.00  f   t    1   t   g  00200    1   -
688  b  17.92   0.205  u  g  aa   v  0.04  f   f    0   f   g  00280  750   -
689  b  35.00   3.375  u  g   c   h  8.29  f   f    0   t   g  00000    0   -

[690 rows x 16 columns]

In [68]:
# re-cast some variable types to its correct type
data['A2'] = data['A2'].astype('float')

In [69]:
# encode target var, A16 to binary
data['A16'] = data['A16'].map({'+':1, '-':0})

In [70]:
print(data)

    A1     A2      A3 A4 A5  A6  A7    A8 A9 A10  A11 A12 A13    A14  A15  A16
0    b  30.83   0.000  u  g   w   v  1.25  t   t    1   f   g  00202    0    1
1    a  58.67   4.460  u  g   q   h  3.04  t   t    6   f   g  00043  560    1
2    a  24.50   0.500  u  g   q   h  1.50  t   f    0   f   g  00280  824    1
3    b  27.83   1.540  u  g   w   v  3.75  t   t    5   t   g  00100    3    1
4    b  20.17   5.625  u  g   w   v  1.71  t   f    0   f   s  00120    0    1
..  ..    ...     ... .. ..  ..  ..   ... ..  ..  ...  ..  ..    ...  ...  ...
685  b  21.08  10.085  y  p   e   h  1.25  f   f    0   f   g  00260    0    0
686  a  22.67   0.750  u  g   c   v  2.00  f   t    2   t   g  00200  394    0
687  a  25.25  13.500  y  p  ff  ff  2.00  f   t    1   t   g  00200    1    0
688  b  17.92   0.205  u  g  aa   v  0.04  f   f    0   f   g  00280  750    0
689  b  35.00   3.375  u  g   c   h  8.29  f   f    0   t   g  00000    0    0

[690 rows x 16 columns]

In [71]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      678 non-null    object
 1   A2      678 non-null    float64
 2   A3      690 non-null    float64
 3   A4      684 non-null    object
 4   A5      684 non-null    object
 5   A6      681 non-null    object
 6   A7      681 non-null    object
 7   A8      690 non-null    float64
 8   A9      690 non-null    object
 9   A10     690 non-null    object
 10  A11     690 non-null    int64
 11  A12     690 non-null    object
 12  A13     690 non-null    object
 13  A14     677 non-null    object
 14  A15     690 non-null    int64
 15  A16     690 non-null    int64
dtypes: float64(3), int64(3), object(10)
memory usage: 86.4+ KB

In [72]:
# data.head(20)
data.tail()

    A1     A2      A3 A4 A5  A6  A7    A8 A9 A10  A11 A12 A13    A14  A15  A16
685  b  21.08  10.085  y  p   e   h  1.25  f   f    0   f   g  00260    0    0
686  a  22.67   0.750  u  g   c   v  2.00  f   t    2   t   g  00200  394    0
687  a  25.25  13.500  y  p  ff  ff  2.00  f   t    1   t   g  00200    1    0
688  b  17.92   0.205  u  g  aa   v  0.04  f   f    0   f   g  00280  750    0
689  b  35.00   3.375  u  g   c   h  8.29  f   f    0   t   g  00000    0    0

In [73]:
data.to_csv('creditApproval.csv', index = False)

In [74]:
# find the categorical variables, dtypes == object
cat_columns = [c for c in data.columns if data[c].dtypes == 'O']

In [75]:
data[cat_columns].head(10)

  A1 A4 A5  A6 A7 A9 A10 A12 A13    A14
0  b  u  g   w  v  t   t   f   g  00202
1  a  u  g   q  h  t   t   f   g  00043
2  a  u  g   q  h  t   f   f   g  00280
3  b  u  g   w  v  t   t   t   g  00100
4  b  u  g   w  v  t   f   f   s  00120
5  b  u  g   m  v  t   f   t   g  00360
6  b  u  g   r  h  t   f   t   g  00164
7  a  u  g  cc  v  t   f   f   g  00080
8  b  y  p   k  h  t   f   f   g  00180
9  b  y  p   w  v  t   f   t   g  00052

In [77]:
# find the not categorical variables, dtypes != object
not_cat_columns = [c for c in data.columns if data[c].dtypes != 'O']
data[not_cat_columns].head(10)

      A2      A3     A8  A11    A15  A16
0  30.83   0.000  1.250    1      0    1
1  58.67   4.460  3.040    6    560    1
2  24.50   0.500  1.500    0    824    1
3  27.83   1.540  3.750    5      3    1
4  20.17   5.625  1.710    0      0    1
5  32.08   4.000  2.500    0      0    1
6  33.17   1.040  6.500    0  31285    1
7  22.92  11.585  0.040    0   1349    1
8  54.42   0.500  3.960    0    314    1
9  42.50   4.915  3.165    0   1442    1

<h2>Task 2 Variables</h2>

In [80]:
# load loan dataset
data = pd.read_csv('/Users/sahajadlakha/Documents/DEV_ZONE/MachineLearning/MLCSE4020/lab-2/data/loan.csv')

In [81]:
data.shape

(10000, 14)

In [82]:
data.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN

# Variables -> Numerical and Categorical
# Numerical: 
    # discrete - 1,2,3
    # continuous - 1.5,111.50
# Categorical
    # Nominal - Names
    # Ordinal - Sunday to Saturday [1,2,..7], True or False [0,1]

In [84]:
data['disbursed_amount'].unique()

array([23201.5 ,  7425.  , 11150.  , ...,  6279.  , 12894.75, 25584.  ])

In [85]:
data['interest'].unique()

array([15.484 , 11.2032,  8.51  , ..., 12.9195, 11.2332, 11.0019])

Print categorical variables

In [86]:
data['householder'].unique()

array(['RENT', 'OWNER', 'MORTGAGE'], dtype=object)

In [87]:
data['householder'].value_counts()

MORTGAGE    4957
RENT        4055
OWNER        988
Name: householder, dtype: int64

In [90]:
cat_columns = [c for c in data.columns if data[c].dtypes == 'O']
data[cat_columns]

,market,employment,time_employed,householder,date_issued,loan_purpose,date_last_payment
0,C,Teacher,<=5 years,RENT,2013-06-11,Debt consolidation,2016-01-14
1,B,Accountant,<=5 years,OWNER,2014-05-08,Car purchase,2016-01-25
2,A,Statistician,<=5 years,RENT,2013-10-26,Debt consolidation,2014-09-26
3,A,Other,<=5 years,RENT,2015-08-20,Debt consolidation,2016-01-26
4,E,Bus driver,>5 years,RENT,2014-07-22,Debt consolidation,2016-01-11
...,...,...,...,...,...,...,...
9995,B,Civil Servant,<=5 years,MORTGAGE,2010-01-14,Other,2010-11-03
9996,B,Civil Servant,<=5 years,RENT,2015-03-20,Debt consolidation,2016-01-26
9997,B,Accountant,>5 years,OWNER,2015-04-03,Debt consolidation,2015-12-12
9998,C,Bus driver,>5 years,RENT,2014-11-23,Debt consolidation,2016-01-01
9999,D,Accountant,>5 years,MORTGAGE,2015-01-19,Debt consolidation,2016-01-16

# Print Dates

In [92]:
data['date_issued'].dtypes

dtype('O')

In [94]:
data['date_issued_dt'] = pd.to_datetime(data['date_issued'])

In [100]:
data.shape

(10000, 17)

## Extracting Date ,  months, years from the converted date

In [97]:
data['month'] = data['date_issued_dt'].dt.month

In [98]:
data['year'] = data['date_issued_dt'].dt.year

In [99]:
print(data)

      customer_id  disbursed_amount  interest market     employment  \
0               0           23201.5   15.4840      C        Teacher
1               1            7425.0   11.2032      B     Accountant
2               2           11150.0    8.5100      A   Statistician
3               3            7600.0    5.8656      A          Other
4               4           31960.0   18.7392      E     Bus driver
...           ...               ...       ...    ...            ...
9995         9995           23750.0   11.0019      B  Civil Servant
9996         9996           11880.0   10.4923      B  Civil Servant
9997         9997           19950.0    8.4364      B     Accountant
9998         9998            4850.0   13.6409      C     Bus driver
9999         9999           25584.0   17.1456      D     Accountant

     time_employed householder    income date_issued  target  \
0        <=5 years        RENT   84600.0  2013-06-11       0
1        <=5 years       OWNER  102000.0  2014-05-08       0
2        <=5 years        RENT   69840.0  2013-10-26       0
3        <=5 years        RENT  100386.0  2015-08-20       0
4         >5 years        RENT   95040.0  2014-07-22       0
...            ...         ...       ...         ...     ...
9995     <=5 years    MORTGAGE   98000.0  2010-01-14       0
9996     <=5 years        RENT   36270.0  2015-03-20       0
9997      >5 years       OWNER   52250.0  2015-04-03       0
9998      >5 years        RENT   80040.0  2014-11-23       0
9999      >5 years    MORTGAGE   72000.0  2015-01-19       0

            loan_purpose  number_open_accounts date_last_payment  \
0     Debt consolidation                   4.0        2016-01-14
1           Car purchase                  13.0        2016-01-25
2     Debt consolidation                   8.0        2014-09-26
3     Debt consolidation                  20.0        2016-01-26
4     Debt consolidation                  14.0        2016-01-11
...                  ...                   ...               ...
9995               Other                  12.0        2010-11-03
9996  Debt consolidation                  17.0        2016-01-26
9997  Debt consolidation                   9.0        2015-12-12
9998  Debt consolidation                  26.0        2016-01-01
9999  Debt consolidation                   5.0        2016-01-16

      number_credit_lines_12 date_issued_dt  month  year
0                        NaN     2013-06-11      6  2013
1                        NaN     2014-05-08      5  2014
2                        NaN     2013-10-26     10  2013
3                        NaN     2015-08-20      8  2015
4                        NaN     2014-07-22      7  2014
...                      ...            ...    ...   ...
9995                     NaN     2010-01-14      1  2010
9996                     NaN     2015-03-20      3  2015
9997                     NaN     2015-04-03      4  2015
9998                     NaN     2014-11-23     11  2014
9999                     NaN     2015-01-19      1  2015

[10000 rows x 17 columns]